{
    "version": "https://jsonfeed.org/version/1",
    "title": "blog",
    "description": "",
    "home_page_url": "https://heyally.ai/blog",
    "feed_url": "https://heyally.ai/blog/feed.json",
    "user_comment": "",
    "author": {
        "name": "Brian Gladu"
    },
    "items": [
        {
            "id": "https://heyally.ai/blog/new-ally-web-clipper-browser-extension-for-safari-on-ios-and-macos/",
            "url": "https://heyally.ai/blog/new-ally-web-clipper-browser-extension-for-safari-on-ios-and-macos/",
            "title": "New: Ally Web Clipper browser extension for Safari on iOS and macOS",
            "summary": "To create a PKM and personal productivity system that actually works, one that you stick with over time — because it works for you and your life — it needs to be easy to add information to it. Tasks. Reminders. Websites. Recipes. Shower thoughts. Really easy. Because if it’s not easy, you won’t do it. Neither will I. Most people won’t because friction kills productivity. Throughout the day, there’s all kinds of information we should&hellip;",
            "content_html": "<p>To create a PKM and personal productivity system that actually works, one that you stick with over time — because it works for you and your life — it needs to be easy to add information to it. Tasks. Reminders. Websites. Recipes. Shower thoughts.</p><p><em>Really</em> easy. Because if it’s not easy, you won’t do it. Neither will I. Most people won’t because <em>friction kills productivity</em>. </p><p>Throughout the day, there’s all kinds of information we should save. To assist you really well, your PKM or productivity system needs these updates in as close to real-time as possible, so it stays in sync with your life. But, if there’s friction, or we lose faith in our system, sometimes we stop saving things and then our system starts to fall apart as it becomes out of sync with our lives and so less helpful.</p><p>This is why Ally is so focused on Quick Capture, with the first of these “frictionless input channels” being <a href=\"https://heyally.ai/features/quick-capture/transcriber\">voice input and transcription</a>. It’s one of the fastest and easiest ways for most people to transfer information from their head, into their digital productivity system of choice.</p><h2 id=\"capturing-web-content-for-later\">Capturing web content for later</h2>\n<p>But, often, we come across web content — the perfect Reddit comment, a great tutorial, a must try recipe, a thought-provoking think piece that’d be perfect for a plane ride — that we want to save for later. We want to add it to our “read it later” reading list. Or we want to catalog it into our recipe archive so we can put it into rotation for family meals. </p><p>If we bookmark it, it might disappear and we have yet another place to check for information we need contributing to that frustrating “I know it’s somewhere…” phenomena that often ends with Googling for it again, defeating the purpose of bookmarking or having a PKM solution.</p><p>Now, saving web content is easy. One click and it is added to your Inbox. That means you have a permanent copy that’s yours forever. If Reddit removes the post, if the website goes down, etc the data is now yours.</p><h2 id=\"introducing-the-ally-web-clipper-safari-extension\">Introducing the Ally web clipper Safari extension</h2>\n<figure class=\"post__image\"><img loading=\"lazy\" src=\"http://briangladu-dropshare.s3-us-east-2.amazonaws.com/browser_web_content-web_clipper.gif\" alt=\"Ally browser extension for Safari\" data-is-external-image=\"true\"></figure><h3 id=\"strip-advertisements--clutter\">Strip advertisements &amp; clutter</h3>\n<p>The Ally web clipper automatically removes all the ads and complex formatting that plague modern websites so when you read it later, you can focus on the content. Read in <a href=\"https://heyally.ai/blog/macos-full-screen-mode/\">Ally’s Full Screen mode</a> for ultimate focus and immersion.</p><h3 id=\"permanent-save--accessible-files\">Permanent save &amp; accessible files</h3>\n<p>With a single click, you can archive a permanent copy of whatever web page you’re on as a Markdown file. If the website disappears, if the article is put behind a paywall, or if you don’t have access to the internet, you’ll still have an archived copy of the web content you need that you can open and read with any text editor. </p><h3 id=\"add-notes-for-context\">Add notes for context</h3>\n<p>Ever come across a web clipping or bookmarked article and wonder why, exactly, you saved it for later? With the Ally Web Clipper browser extension you can <em>add notes before saving the page</em> so you’ll understand why you thought it was important later. Your future self will thank you. You can also add tags to automatically place it in your Library.</p><h3 id=\"custom-keyboard-shortcuts\">Custom keyboard shortcuts</h3>\n<p>Configure whatever keyboard shortcut you want for the fastest save possible. No reason to touch a mouse. By default it is <code>fn + shift + s.</code> </p><h3 id=\"automatic-context-processing\">Automatic context processing</h3>\n<p>Your web clippings and web content are automatically processed into vector embeddings and further processed into an evolving knowledge graph that creates temporally-aware relationships between data and concepts. This all happens locally on your device and no data ever leaves your device. This means you can be sure that the content you saved last week or last year is easily surfaced when you need it by your own personal 100% local AI assistant powered by a <a href=\"https://heyally.ai/features/local-llm\">local LLM</a> running on your device. </p><p>This also means that every web page you archive <a href=\"https://heyally.ai/blog/public-beta-advanced-local-llm-memory-for-ally/\">adds to Ally’s knowledge, so it’s more capable of assisting you</a> with whatever you’re working on. You may have forgotten about that Medium article you saw a few months back, but Ally will find and surface it and pull info from it to assist you with whatever you’re working on at that moment.</p><h2 id=\"how-to-install-the-safari-browser-web-clipper-extension-on-macos\">How to install the Safari browser web clipper extension on macOS</h2>\n<p>The Ally Web Clipper browser extension for macOS and iOS Safari is automatically included when you download the apps from the App Store. You don’t need to download anything additional after you’ve downloaded the apps. </p><ol>\n<li>Download and install Ally</li>\n<li>Open Safari</li>\n<li>Go to <code>Settings &gt; Extensions</code></li>\n<li>Activate the Ally Web Clipper extension by clicking the box next to it</li>\n</ol>\n<h2 id=\"using-the-web-clipper\">Using the web clipper</h2>\n<p>There are a two ways you can use the web clipper extension to save content:</p><h3 id=\"clicking-the-ally-icon-in-the-toolbar\">Clicking the Ally icon in the toolbar</h3>\n<ol>\n<li>Click the icon that appears next to the Safari address bar. </li>\n<li>A dropdown will appear that gives you the option to add any notes. This is a good idea if you often find yourself wondering why you saved something when you find it later. </li>\n<li>Click <code>Save to Ally</code> and it will automatically appear in your Unified Inbox</li>\n</ol>\n<h3 id=\"with-configurable-keyboard-shortcuts\">With configurable keyboard shortcuts</h3>\n<p>The quickest way to save web content is with a keyboard shortcut that bypasses the “add notes” step. When you use the keyboard shortcut, the web page is instantly saved and archived. </p><p>See the help doc on the Ally Web Clipper for more detailed information on <a href=\"https://heyally.ai/docs/getting-started/set-up-web-clipper\">setting up and using the web clipper browser extension</a> to save web pages.</p>",
            "author": {
                "name": "Brian Gladu"
            },
            "tags": [
                   "updates",
                   "macos",
                   "ios"
            ],
            "date_published": "2026-01-10T19:00:04-05:00",
            "date_modified": "2026-01-11T14:00:47-05:00"
        },
        {
            "id": "https://heyally.ai/blog/public-beta-advanced-local-llm-memory-for-ally/",
            "url": "https://heyally.ai/blog/public-beta-advanced-local-llm-memory-for-ally/",
            "title": "Public beta: Advanced local LLM memory for Ally",
            "summary": "Ally features a fully local LLM and chat experience similar to what’s offered by Ollama or Osauraus. But, Ally is so much more than just a local LLM server and basic chat. It’s designed to learn about you over time so that it can be more helpful. Since all of this happens completely locally and privately, and no data is ever shared with anyone, ever, you don’t have to worry about some creepy company using&hellip;",
            "content_html": "<p>Ally features a <a href=\"https://heyally.ai/features/local-llm\">fully local LLM and chat experience</a> similar to what’s offered by Ollama or Osauraus. </p><p>But, Ally is so much more than just a local LLM server and basic chat. It’s designed to learn about you over time so that it can be more helpful. Since all of this happens completely locally and privately, and no data is ever shared with anyone, ever, you don’t have to worry about some creepy company using what it learns to show you ads or leaking your data, etc. </p><p>Ally isn’t just doing basic RAG or semantic search. I’ve invested heavily into creating a sophisticated context system that allows Ally to not just recall, but understand the relationships between concepts and information. Multiple layers of context are added to help Ally understand not only what you’re working on at this very moment, but also how it fits into the bigger picture. </p><p>These two new memory features are two additional layers on top of Ally’s unique Shared Context feature. </p><p>Now, as you chat with Ally, it automatically stores key facts and information. This works very similar to the automatic memory features of ChatGPT and Claude. </p><p>As you work, your notes are automatically converted into vector embeddings so they can be searched. Then, your chats and notes are automatically processed into an evolving knowledge graph that stores how information is related.</p><p>All of this means Ally does more than just store and retain information, it understands your life by combining context from many sources. </p><h2 id=\"how-to-turn-on-the-advanced-memory-and-context-features-beta\">How to turn on the advanced memory and context features beta:</h2>\n<p>Starting with macOS v1.3.3, if you go into <code>Settings &gt; AI</code> and scroll below the list of LLMs, you’ll see a couple of new options to enable Ally’s advanced memory features:</p><figure class=\"post__image\"><img loading=\"lazy\" src=\"http://briangladu-dropshare.s3-us-east-2.amazonaws.com/Screenshot-2026-01-09-at-1.39.24-PM.png\" alt=\"image\" data-is-external-image=\"true\"></figure><p>Please note that turning on memory features will slow response times. It takes additional time to search memories and it also takes additional time to load the additional context. </p>",
            "author": {
                "name": "Brian Gladu"
            },
            "tags": [
                   "updates",
                   "macos"
            ],
            "date_published": "2026-01-09T08:37:02-05:00",
            "date_modified": "2026-01-10T19:52:23-05:00"
        },
        {
            "id": "https://heyally.ai/blog/themes-for-ally/",
            "url": "https://heyally.ai/blog/themes-for-ally/",
            "title": "Themes for Ally!",
            "summary": "Now you can customize the look and feel of Ally on iOS and macOS with three themes. Newspaper theme Newspaper is a grayscale monochrome theme for people who like light themes. It has a near white background, containers and fields are shades of gray, and text is near black gray. Monochrome theme For dark theme lovers, monochrome has a near black background, dark container backgrounds, and near white text. Primary theme My personal favorite, Primary&hellip;",
            "content_html": "\n  <p>\n    Now you can customize the look and feel of Ally on iOS and macOS with three themes.<br><br><strong>Newspaper theme<br></strong>Newspaper is a grayscale monochrome theme for people who like light themes. It has a near white background, containers and fields are shades of gray, and text is near black gray.<br>\n  </p>\n\n    <figure class=\"post__image post__image--center\">\n      <img loading=\"lazy\" src=\"https://heyally.ai/blog/media/posts/11/Screenshot-2025-12-11-at-2.38.20-PM-1.png\" height=\"1177\" width=\"2071\" alt=\"\"  sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://heyally.ai/blog/media/posts/11/responsive/Screenshot-2025-12-11-at-2.38.20-PM-1-xs.webp 640w ,https://heyally.ai/blog/media/posts/11/responsive/Screenshot-2025-12-11-at-2.38.20-PM-1-sm.webp 768w ,https://heyally.ai/blog/media/posts/11/responsive/Screenshot-2025-12-11-at-2.38.20-PM-1-md.webp 1024w ,https://heyally.ai/blog/media/posts/11/responsive/Screenshot-2025-12-11-at-2.38.20-PM-1-lg.webp 1366w ,https://heyally.ai/blog/media/posts/11/responsive/Screenshot-2025-12-11-at-2.38.20-PM-1-xl.webp 1600w ,https://heyally.ai/blog/media/posts/11/responsive/Screenshot-2025-12-11-at-2.38.20-PM-1-2xl.webp 1920w\">\n      \n    </figure>\n\n  <p>\n    <b>Monochrome theme<br></b>For dark theme lovers, monochrome has a near black background, dark container backgrounds, and near white text.<br>\n  </p>\n\n    <figure class=\"post__image post__image--center\">\n      <img loading=\"lazy\" src=\"https://heyally.ai/blog/media/posts/11/Screenshot-2025-12-11-at-2.48.34-PM-1.png\" height=\"1177\" width=\"2780\" alt=\"\"  sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://heyally.ai/blog/media/posts/11/responsive/Screenshot-2025-12-11-at-2.48.34-PM-1-xs.webp 640w ,https://heyally.ai/blog/media/posts/11/responsive/Screenshot-2025-12-11-at-2.48.34-PM-1-sm.webp 768w ,https://heyally.ai/blog/media/posts/11/responsive/Screenshot-2025-12-11-at-2.48.34-PM-1-md.webp 1024w ,https://heyally.ai/blog/media/posts/11/responsive/Screenshot-2025-12-11-at-2.48.34-PM-1-lg.webp 1366w ,https://heyally.ai/blog/media/posts/11/responsive/Screenshot-2025-12-11-at-2.48.34-PM-1-xl.webp 1600w ,https://heyally.ai/blog/media/posts/11/responsive/Screenshot-2025-12-11-at-2.48.34-PM-1-2xl.webp 1920w\">\n      \n    </figure>\n\n  <p>\n    <b>Primary theme<br></b>My personal favorite, Primary is a low contrast theme with a brown background, green highlights, a text is shades of cream-colored off whites. The theme for those who like a bit of color.<br>\n  </p>\n\n    <figure class=\"post__image post__image--center\">\n      <img loading=\"lazy\" src=\"https://heyally.ai/blog/media/posts/11/Screenshot-2025-12-11-at-2.29.59-PM-1-2.png\" height=\"1177\" width=\"1134\" alt=\"\"  sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://heyally.ai/blog/media/posts/11/responsive/Screenshot-2025-12-11-at-2.29.59-PM-1-2-xs.webp 640w ,https://heyally.ai/blog/media/posts/11/responsive/Screenshot-2025-12-11-at-2.29.59-PM-1-2-sm.webp 768w ,https://heyally.ai/blog/media/posts/11/responsive/Screenshot-2025-12-11-at-2.29.59-PM-1-2-md.webp 1024w ,https://heyally.ai/blog/media/posts/11/responsive/Screenshot-2025-12-11-at-2.29.59-PM-1-2-lg.webp 1366w ,https://heyally.ai/blog/media/posts/11/responsive/Screenshot-2025-12-11-at-2.29.59-PM-1-2-xl.webp 1600w ,https://heyally.ai/blog/media/posts/11/responsive/Screenshot-2025-12-11-at-2.29.59-PM-1-2-2xl.webp 1920w\">\n      \n    </figure>\n\n  <p>\n    This is just the beginning... what other themes would you like to see? What fonts would you like Ally to support?&nbsp;\n  </p>",
            "author": {
                "name": "Brian Gladu"
            },
            "tags": [
                   "updates",
                   "macos",
                   "ios"
            ],
            "date_published": "2025-12-11T17:12:21-05:00",
            "date_modified": "2025-12-18T16:01:59-05:00"
        },
        {
            "id": "https://heyally.ai/blog/ios-action-button/",
            "url": "https://heyally.ai/blog/ios-action-button/",
            "title": "iPhone Action button shortcut support for iOS",
            "summary": "One of the core goals of Ally as a productivity solution is ensuring communication with Ally is fast and easy. You should be able to add a todo, capture an idea, or get the date of your next meeting without friction. There’s no faster way to capture quick thoughts, reminders, and notes than with dictation and there’s no faster way to start dictation than with the iPhone Action button, a configurable hardware button on 14,&hellip;",
            "content_html": "<p>One of the core goals of Ally as a productivity solution is ensuring communication with Ally is fast and easy. You should be able to add a todo, capture an idea, or get the date of your next meeting without friction.</p><p>There’s no faster way to capture quick thoughts, reminders, and notes than with dictation and there’s no faster way to start dictation than with the <a href=\"https://support.apple.com/guide/iphone/use-and-customize-the-action-button-iphe89d61d66/ios\">iPhone Action button</a>, a configurable hardware button on 14, 15, 16, and 17 series iPhones.</p><p>The <a href=\"https://apps.apple.com/us/app/ally-ai-for-life/id6752736179\">iOS app</a> was recently updated to include an Action button shortcut that instantly opens <a href=\"https://heyally.ai\">the Ally AI iOS app</a> and starts a recording. </p><p>This means you can capture any thought instantly any time your phone is near with just a single click. It’s the fastest, most frictionless way to pass information from your head to Ally where it can be organized and retrieved when needed.</p><p>It’s a great way to get things out of your head and into your Ally Inbox where you can then store, organize, and leverage it in the future. </p><h2 id=\"how-to-configure-your-iphones-action-button-to-quickly-capture-and-transcribe-voice-notes\">How to configure your iPhone’s Action button to quickly capture and transcribe voice notes:</h2>\n<ol>\n<li><p>Install the <a href=\"https://apps.apple.com/us/app/ally-ai-for-life/id6752736179\">Ally AI iOS app</a> from the iOS app store. </p></li>\n<li><p>Open the Settings app on your iPhone. </p></li>\n<li><p>Scroll down to find Action Button in the list and tap it to open its options. </p></li>\n<li><p>Swipe right to left to scroll through the options until you reach Shortcut. </p></li>\n<li><p>Press the selector and search the available shortcuts for <code>Ally</code>. </p></li>\n<li><p>Choose <code>Start Recording</code> by pressing it. </p></li>\n<li><p>Close the Settings app. </p></li>\n<li><p>Press and hold the Action button on your phone to do a test recording.</p></li>\n</ol>\n<p>Being able to quickly capture voice notes is like a super power. You can get things out of your head and into a productivity system with minimal friction and get back to whatever needs your attention. </p>",
            "author": {
                "name": "Brian Gladu"
            },
            "tags": [
                   "updates",
                   "ios"
            ],
            "date_published": "2025-12-08T17:43:37-05:00",
            "date_modified": "2025-12-18T16:02:19-05:00"
        },
        {
            "id": "https://heyally.ai/blog/macos-full-screen-mode/",
            "url": "https://heyally.ai/blog/macos-full-screen-mode/",
            "title": "Ally macOS app gets native full screen mode support",
            "summary": "Long periods of unbroken concentration, that most of us require to achieve the deep focus that leads to “deep work,” are increasingly challenging to come by. We know our best work comes from focus, but it can be challenging to tailor our digital workspaces to minimize distractions. Even on macOS, an operating system built for the desktop/laptop format, and so tailored toward productivity, work, and creation, they’re, at least in some ways, intentionally designed to&hellip;",
            "content_html": "<p>Long periods of unbroken concentration, that most of us require to achieve the deep focus that leads to “<a href=\"https://www.amazon.com/Deep-Work-Focused-Success-Distracted/dp/1455586692\">deep work</a>,” are increasingly challenging to come by.</p><p>We know our best work comes from focus, but it can be challenging to tailor our digital workspaces to minimize distractions. Even on macOS, an operating system built for the desktop/laptop format, and so tailored toward productivity, work, and creation, they’re, at least in some ways, intentionally <em>designed to divert our attention away from whatever we’re trying to do</em>, such as for alerts and notifications. There’s also a row of colorful icons tempting us to stray from our intended focus. </p><p><a href=\"https://support.apple.com/guide/mac-help/use-apps-in-full-screen-mchl9c21d2be/mac\">macOS’s full-screen mode</a> helps with focus and concentration, thereby improving our ability to achieve the flow state many of us need to do our best work. It simply minimizes distracting visual clutter by devoting the entire screen to a single app. This is an app experience that’s default behavior on Windows, but not macOS. Both modes have their uses and benefits, so it doesn’t really make sense to frame it as a “right or wrong” debate. </p><p>But, for deep work, work that requires prolonged intense focus to be productive, many of us benefit from minimal distraction, and things like macOS’s full-screen mode help a lot by massively trimming distracting and potentially overwhelming visual noise. For anyone closer to the challenging end of the attention spectrum, the “multi-task mode” that macOS encourages by default can actually be a sneaky productivity killer. It can feel like we’re getting a lot done, but we’re really shuffling around windows and never really delving deep enough into any particular thing to solve a complex problem, come up with a great new idea, or uncover important nuance in a data set.  </p><p>Now <a href=\"https://heyally.ai\">Ally</a> supports full-screen mode so you can laser focus on whatever doc you’re creating, web clipping you’re reading, or AI chat you’re having. </p><p>To get started, <a href=\"https://apps.apple.com/us/app/ally-ai-for-life/id6752736179\">download the latest version of the Ally AI app from the macOS app store</a>. </p><p>With the <a href=\"https://heyally.ai\">Ally app</a> running, press the key combination <code>fn + f</code> or click the green circle icon in the upper left-hand corner of the app. </p><p>To exit full screen mode, you can press <code>esc</code>, <code>fn + f</code> again, or click the green circle icon that appears when you hover the upper left-hand corner of the app while in full screen mode.</p><p>You can also arrange the Ally app side by side with other apps, such as a web browser or PDF viewer, by clicking and holding the green circle icon, then selecting one of the tile options to arrange the window. </p><p>Now you can focus better with fewer visual distractions competing for your attention. </p><p>I’ll continue looking for new ways to leverage Apple’s ecosystem to make productivity easier with Ally. If you have an idea, <a href=\"mailto:hi@heyally.ai\">let me know</a> or <a href=\"https://ally.eververse.ai/\">submit as a feature request</a> and I’ll add it to the community-driven roadmap. </p>",
            "author": {
                "name": "Brian Gladu"
            },
            "tags": [
                   "updates",
                   "macos"
            ],
            "date_published": "2025-12-07T16:30:12-05:00",
            "date_modified": "2025-12-18T16:02:25-05:00"
        }
    ]
}
